Twist/Twist-TAS/servicerequestfiles/redeemPINCard.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:red="http://b2b.tracfone.com/RedemptionServices" xmlns:com="http://www.tracfone.com/CommonTypes" xmlns:phon="http://www.tracfone.com/PhoneCommonTypes">
    <soap:Header xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <wsse:Security soap:mustUnderstand="0" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="unt_tOxd0xWBw6Mipr7R" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>@secusername</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">@secpassword</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soap:Header>
   <soapenv:Body>
      <red:redeemPINCardRequest>
         <com:requestToken>
            <com:clientTransactionId>1234</com:clientTransactionId>
            <com:clientId>123</com:clientId>
         </com:requestToken>
         <com:brandName>@brand</com:brandName>
         <com:sourceSystem>WEB</com:sourceSystem>
         <!--Optional:-->
         <com:language>ENG</com:language>
         <red:pinCardNum>@pin</red:pinCardNum>
         <red:deviceId>
            <phon:esn>@esn</phon:esn>
         </red:deviceId>
         <red:redeemNow>true</red:redeemNow>
      </red:redeemPINCardRequest>
   </soapenv:Body>
</soapenv:Envelope>

